In [1]:
import findspark
findspark.init()
import pyspark

In [2]:
import pandas as pd

In [3]:
churn = pd.read_csv("D:\downloads\Churn.csv",sep=";")

In [4]:
churn.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,France,Female,42,2,0,1,1,1,10134888,1
1,608,Spain,Female,41,1,8380786,1,0,1,11254258,0
2,502,France,Female,42,8,1596608,3,1,0,11393157,1
3,699,France,Female,39,1,0,2,0,0,9382663,0
4,850,Spain,Female,43,2,12551082,1,1,1,790841,0

In [5]:
type(churn)

pandas.core.frame.DataFrame

In [6]:
from pyspark.sql import SparkSession

In [7]:
spark = SparkSession.builder.appName("Pandas").getOrCreate()

In [8]:
churn_df = spark.createDataFrame(churn)

In [9]:
type(churn_df)

pyspark.sql.dataframe.DataFrame

In [10]:
churn_df.show(2)

+-----------+---------+------+---+------+-------+-------------+---------+--------------+---------------+------+
|CreditScore|Geography|Gender|Age|Tenure|Balance|NumOfProducts|HasCrCard|IsActiveMember|EstimatedSalary|Exited|
+-----------+---------+------+---+------+-------+-------------+---------+--------------+---------------+------+
|        619|   France|Female| 42|     2|      0|            1|        1|             1|       10134888|     1|
|        608|    Spain|Female| 41|     1|8380786|            1|        0|             1|       11254258|     0|
+-----------+---------+------+---+------+-------+-------------+---------+--------------+---------------+------+
only showing top 2 rows

In [11]:
pandas_df = churn_df.toPandas()

In [12]:
type(pandas_df)

pandas.core.frame.DataFrame

In [14]:
pandas_df.head(2)

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,France,Female,42,2,0,1,1,1,10134888,1
1,608,Spain,Female,41,1,8380786,1,0,1,11254258,0